## Plan Result (prod-shutter)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 8 to add, 0 to change, 3 to destroy.</code></pre>

* Create
  * module.shutter.azurerm_cdn_endpoint.shutter_endpoint[&#34;private-law&#34;]
  * module.shutter.azurerm_cdn_profile.main[&#34;prl&#34;]
  * module.shutter.azurerm_storage_account.shutter_store[&#34;private-law&#34;]
  * module.shutter.azurerm_template_deployment.custom_domain[&#34;private-law&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;private-law&#34;]
* Replace
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;et-sya&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;ia-aip&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;manage-payments&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.shutter.azurerm_cdn_endpoint.shutter_endpoint["private-law"] will be created
  + resource "azurerm_cdn_endpoint" "shutter_endpoint" {
      + content_types_to_compress     = (known after apply)
      + fqdn                          = (known after apply)
      + id                            = (known after apply)
      + is_compression_enabled        = false
      + is_http_allowed               = false
      + is_https_allowed              = true
      + location                      = "westus"
      + name                          = "hmcts-apply-to-court-about-child-arrangements-c1"
      + origin_host_header            = (known after apply)
      + origin_path                   = (known after apply)
      + probe_path                    = (known after apply)
      + profile_name                  = "hmcts-shutter-prl"
      + querystring_caching_behaviour = "IgnoreQueryString"
      + resource_group_name           = "shutter-app-prod-rg"
      + tags                          = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
        }

      + origin {
          + host_name  = (known after apply)
          + http_port  = 80
          + https_port = 443
          + name       = (known after apply)
        }
    }

  # module.shutter.azurerm_cdn_profile.main["prl"] will be created
  + resource "azurerm_cdn_profile" "main" {
      + id                  = (known after apply)
      + location            = "westus"
      + name                = "hmcts-shutter-prl"
      + resource_group_name = "shutter-app-prod-rg"
      + sku                 = "Standard_Verizon"
      + tags                = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
    }

  # module.shutter.azurerm_storage_account.shutter_store["private-law"] will be created
  + resource "azurerm_storage_account" "shutter_store" {
      + access_tier                       = (known after apply)
      + account_kind                      = "StorageV2"
      + account_replication_type          = "RAGRS"
      + account_tier                      = "Standard"
      + allow_nested_items_to_be_public   = false
      + cross_tenant_replication_enabled  = false
      + default_to_oauth_authentication   = false
      + enable_https_traffic_only         = true
      + id                                = (known after apply)
      + infrastructure_encryption_enabled = false
      + is_hns_enabled                    = false
      + large_file_share_enabled          = (known after apply)
      + location                          = "uksouth"
      + min_tls_version                   = "TLS1_0"
      + name                              = "hmctsprivatelshutterprod"
      + nfsv3_enabled                     = false
      + primary_access_key                = (sensitive value)
      + primary_blob_connection_string    = (sensitive value)
      + primary_blob_endpoint             = (known after apply)
      + primary_blob_host                 = (known after apply)
      + primary_connection_string         = (sensitive value)
      + primary_dfs_endpoint              = (known after apply)
      + primary_dfs_host                  = (known after apply)
      + primary_file_endpoint             = (known after apply)
      + primary_file_host                 = (known after apply)
      + primary_location                  = (known after apply)
      + primary_queue_endpoint            = (known after apply)
      + primary_queue_host                = (known after apply)
      + primary_table_endpoint            = (known after apply)
      + primary_table_host                = (known after apply)
      + primary_web_endpoint              = (known after apply)
      + primary_web_host                  = (known after apply)
      + public_network_access_enabled     = true
      + queue_encryption_key_type         = "Service"
      + resource_group_name               = "shutter-app-prod-rg"
      + secondary_access_key              = (sensitive value)
      + secondary_blob_connection_string  = (sensitive value)
      + secondary_blob_endpoint           = (known after apply)
      + secondary_blob_host               = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_dfs_endpoint            = (known after apply)
      + secondary_dfs_host                = (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      + secondary_location                = (known after apply)
      + secondary_queue_endpoint          = (known after apply)
      + secondary_queue_host              = (known after apply)
      + secondary_table_endpoint          = (known after apply)
      + secondary_table_host              = (known after apply)
      + secondary_web_endpoint            = (known after apply)
      + secondary_web_host                = (known after apply)
      + sftp_enabled                      = false
      + shared_access_key_enabled         = true
      + table_encryption_key_type         = "Service"
      + tags                              = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
        }

      + static_website {
          + error_404_document = "index.html"
          + index_document     = "index.html"
        }
    }

  # module.shutter.azurerm_template_deployment.custom_domain["private-law"] will be created
  + resource "azurerm_template_deployment" "custom_domain" {
      + deployment_mode     = "Incremental"
      + id                  = (known after apply)
      + name                = "apply-to-court-about-child-arrangements-c100"
      + outputs             = (known after apply)
      + parameters          = {
          + "hostName" = "www.apply-to-court-about-child-arrangements-c100.service.gov.uk/"
          + "name"     = "hmcts-shutter-prl/hmcts-apply-to-court-about-child-arrangements-c1/www-apply-to-court-about-child-arrangements-c100-service-gov-uk/"
        }
      + resource_group_name = "shutter-app-prod-rg"
      + template_body       = jsonencode(
            {
              + "$schema"      = "http://schema.management.azure.com/schemas/2015-01-01/deploymentTemplate.json"
              + contentVersion = "1.0.0.0"
              + parameters     = {
                  + hostName = {
                      + type = "string"
                    }
                  + name     = {
                      + type = "string"
                    }
                }
              + resources      = [
                  + {
                      + apiVersion = "2019-04-15"
                      + name       = "[parameters('name')]"
                      + properties = "[variables('properties')]"
                      + type       = "microsoft.cdn/profiles/endpoints/customdomains"
                    },
                ]
              + variables      = {
                  + properties = {
                      + hostName = "[parameters('hostName')]"
                    }
                }
            }
        )
    }

  # module.shutter.null_resource.enable_custom_https_cmd["et-sya"] must be replaced
-/+ resource "null_resource" "enable_custom_https_cmd" {
      ~ id       = "8013654982923755384" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "certificate_latest_version" = "d3a3720e8a4c4700a2a98a6577b2ab4a" -> "d90d972714f442f09f33f3efc2b37666"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["ia-aip"] must be replaced
-/+ resource "null_resource" "enable_custom_https_cmd" {
      ~ id       = "2948720547444333744" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "certificate_latest_version" = "4e4d220a076742209a2b05d9318561e2" -> "9427d4e5db9340898a631dc4359f10d3"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["manage-payments"] must be replaced
-/+ resource "null_resource" "enable_custom_https_cmd" {
      ~ id       = "1376076421634071466" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "certificate_latest_version" = "ae029be07fa9463cb6153dd0881571e1" -> "54044681188744409aebeadd49f935b3"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["private-law"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "bfa4a0af6146404f8e6d43715a75de42"
        }
    }

Plan: 8 to add, 0 to change, 3 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1397,"Program":"tfcmt","SHA1":"","Target":"prod-shutter","Vars":{}} -->